In [9]:
print("hello")

hello

In [11]:
val=input("Enter any value:")
print(val)

Enter any value: gopal

gopal

In [19]:
import keyword
print(keyword.kwlist)

['False', 'None', 'True', 'and', 'as', 'assert', 'async', 'await', 'break', 'class', 'continue', 'def', 'del', 'elif', 'else', 'except', 'finally', 'for', 'from', 'global', 'if', 'import', 'in', 'is', 'lambda', 'nonlocal', 'not', 'or', 'pass', 'raise', 'return', 'try', 'while', 'with', 'yield']

In [23]:
name="gopal"
print(id(name))
print(id(name))

2281208123568
2281208123568

In [3]:
a=25
b=20
#adding if 2 numbers
print(a+b)
#subtracting of 2 numbers
print(a-b)
#multiplication
print(a*b)
#division
print(round(a/b,1))
#s

45
5
500
1.2

In [29]:
print(33+16)

49

conditional statements

In [35]:
import random 
import math 
print(math.ceil(random.random()))

1

In [ ]:
name="gopal"
rev=""
for i in range(len(name)-1,-1,-1):
    rev+=name[i]
if rev==name:
    print("It is palindrome")
else:
    print("It is not a palindrome")

It is not a palindrome

In [64]:
value=int(input())
lis="a b c d e f g h i j k l m n o p q r s t u v w x y"
lis1=(lis.split(" "))
# print(lis1)
count=1
for i in lis1:
    if count<value:
        print(i,end=" ")
        count+=1
    else:
        print(i)
        count=1

a b c d e
f g h i j
k l m n o
p q r s t
u v w x y

In [33]:
count=0
for i in range(65,91):
    print(chr(i),end=" ")
    count+=1
    if count==5:
        print( )
        count=0

A B C D E
F G H I J
K L M N O
P Q R S T
U V W X Y
Z

In [49]:
dict1={"name":"Gopi","roll no":21,"age":20}   
dict1["age"]=22

In [51]:
dict1

{'name': 'Gopi', 'roll no': 21, 'age': 22}

In [5]:
import pandas as pd
df=pd.read_csv("titanics.csv")

In [7]:
df.head(10)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,0,0,330877,8.4583,NaN,Q
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
7,8,0,3,"Palsson, Master. Gosta Leonard",male,2.0,3,1,349909,21.0750,NaN,S
8,9,1,3,"Johnson, Mrs. Oscar W (Elisabeth Vilhelmina Berg)",female,27.0,0,2,347742,11.1333,NaN,S
9,10,1,2,"Nasser, Mrs. Nicholas (Adele Achem)",female,14.0,1,0,237736,30.0708,NaN,C

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [11]:
df["PassengerId"].value_counts()

PassengerId
1      1
599    1
588    1
589    1
590    1
      ..
301    1
302    1
303    1
304    1
891    1
Name: count, Length: 891, dtype: int64

In [19]:
df["Age"].isna().sum()

177